/* automatically generated by rust-bindgen 0.57.0 */
#![allow(warnings, unused)]
#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const SPIRO_ARC_CUB_QUAD_MASK: u32 = 28672;
pub const SPIRO_CUBIC_TO_BEZIER: u32 = 0;
pub const SPIRO_CUBIC_MIN_MAYBE: u32 = 4096;
pub const SPIRO_ARC_MAYBE: u32 = 8192;
pub const SPIRO_ARC_MIN_MAYBE: u32 = 12288;
pub const SPIRO_QUAD0_TO_BEZIER: u32 = 16384;
pub const MmMax: u32 = 16;
pub const AppleMmMax: u32 = 26;
pub const BACK_LAYER_MAX: u32 = 256;
pub const COLOR_INHERITED: u32 = 4294967294;
pub const WIDTH_INHERITED: i32 = -1;
pub const DASH_INHERITED: u32 = 255;
pub const DASH_MAX: u32 = 8;
pub const JLIMIT_INHERITED: i32 = -1;
pub const MAX_LANG: u32 = 4;
pub const FF_KERNCLASS_FLAG_NATIVE: u32 = 2;
pub const FF_KERNCLASS_FLAG_FEATURE: u32 = 4;
pub const FF_KERNCLASS_FLAG_NAMETYPE: u32 = 8;
pub const FF_KERNCLASS_FLAG_NAMELEGACY: u32 = 16;
pub const FF_KERNCLASS_FLAG_VIRTUAL: u32 = 32;
pub const FF_KERNCLASS_FLAG_FLATTEN: u32 = 64;
pub const FF_KERNCLASS_FLAG_SINGLECHAR: u32 = 96;
pub const UNDO_LAYER_UNKNOWN: i32 = -1;
pub const HntMax: u32 = 96;
pub const TEX_UNDEF: u32 = 32767;
pub const sfntRevisionUnset: u32 = 1145328981;
pub const woffUnset: u32 = 17493;
pub const GROUP_NAME_KERNING_UFO: u32 = 1;
pub const GROUP_NAME_KERNING_FEATURE: u32 = 2;
pub const GROUP_NAME_VERTICAL: u32 = 4;
pub const GROUP_NAME_RIGHT: u32 = 8;
pub const UNDEFINED_WIDTH: i32 = -999999;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type size_t = ::std::os::raw::c_ulong;
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type ssize_t = __ssize_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type int32 = i32;
pub type uint32 = u32;
pub type int16 = i16;
pub type uint16 = u16;
pub type int8 = i8;
pub type uint8 = u8;
pub type intpt = isize;
pub type unichar_t = uint32;
extern "C" {
    pub fn NoMoreMemMessage();
}
#[doc = " Doubly linked list abstraction. Putting a full member of this"]
#[doc = " struct first in another struct means you can treat it as a"]
#[doc = " dlinkedlist. You can have a struct in many lists simply by"]
#[doc = " embedding another dlistnode member and handing a pointer to that"]
#[doc = " member to the dlist() helper functions. Double linking has big"]
#[doc = " advantages in removal of single elements where you do not need to"]
#[doc = " rescan to find removeme->prev;"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dlistnode {
    pub next: *mut dlistnode,
    pub prev: *mut dlistnode,
}
#[test]
fn bindgen_test_layout_dlistnode() {
    assert_eq!(
        ::std::mem::size_of::<dlistnode>(),
        16usize,
        concat!("Size of: ", stringify!(dlistnode))
    );
    assert_eq!(
        ::std::mem::align_of::<dlistnode>(),
        8usize,
        concat!("Alignment of ", stringify!(dlistnode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dlistnode>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dlistnode),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dlistnode>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dlistnode),
            "::",
            stringify!(prev)
        )
    );
}
#[doc = " DEVELOPERS: make sure the start of this struct is compatible with"]
#[doc = " dlistnode. While I could use the dlistnode as a first member, using"]
#[doc = " a copy of the members in the same order as dlistnode has them"]
#[doc = " allows callers using this struct a bit simpler access."]
#[doc = ""]
#[doc = " While one can embed a dlistnode member into a struct to create"]
#[doc = " linked lists, sometimes you want to return a splice of one of those"]
#[doc = " lists. For example, if you have a double linked list of all your"]
#[doc = " hotkeys, you might like to return only the ones that have a"]
#[doc = " modifier of the Control key. You want to leave the hotkey structs"]
#[doc = " in their original list, but create a new kust that references just"]
#[doc = " a desired selection of objects."]
#[doc = ""]
#[doc = " In other words, if you have some data you want to return in a"]
#[doc = " double linked list, then use this node type. You can build one up"]
#[doc = " using dlist_pushfront_external() and the caller can free that list"]
#[doc = " using dlist_free_external(). Any of the foreach() functions will"]
#[doc = " work to iterate a list of dlistnodeExternal as this list is"]
#[doc = " identical to a dlistnode with an extra ptr payload."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dlistnodeExternal {
    pub next: *mut dlistnode,
    pub prev: *mut dlistnode,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_dlistnodeExternal() {
    assert_eq!(
        ::std::mem::size_of::<dlistnodeExternal>(),
        24usize,
        concat!("Size of: ", stringify!(dlistnodeExternal))
    );
    assert_eq!(
        ::std::mem::align_of::<dlistnodeExternal>(),
        8usize,
        concat!("Alignment of ", stringify!(dlistnodeExternal))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dlistnodeExternal>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dlistnodeExternal),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dlistnodeExternal>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dlistnodeExternal),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dlistnodeExternal>())).ptr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dlistnodeExternal),
            "::",
            stringify!(ptr)
        )
    );
}
extern "C" {
    #[doc = " Push the node onto the head of the list"]
    pub fn dlist_pushfront(list: *mut *mut dlistnode, node: *mut dlistnode);
}
extern "C" {
    #[doc = " Take the last node off the list and return it. If the list is empty, return 0."]
    pub fn dlist_popback(list: *mut *mut dlistnode) -> *mut dlistnode;
}
extern "C" {
    #[doc = " the number of nodes in the list"]
    pub fn dlist_size(list: *mut *mut dlistnode) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " is the list empty"]
    pub fn dlist_isempty(list: *mut *mut dlistnode) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove the node from the list. The node itself is not free()ed."]
    #[doc = " That is still up to the caller. All this function does is preserve"]
    #[doc = " the list structure without the node being in it."]
    pub fn dlist_erase(list: *mut *mut dlistnode, node: *mut dlistnode);
}
pub type dlist_foreach_func_type =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut dlistnode)>;
extern "C" {
    #[doc = " Call func for every node in the list. This is a defensive"]
    #[doc = "  implementation, if you want to remove a node from the list inside"]
    #[doc = "  func() that is perfectly fine."]
    pub fn dlist_foreach(list: *mut *mut dlistnode, func: dlist_foreach_func_type);
}
pub type dlist_foreach_udata_func_type = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut dlistnode, udata: *mut ::std::os::raw::c_void),
>;
extern "C" {
    #[doc = " Like dlist_foreach(), defensive coding still, but the udata pointer"]
    #[doc = " is passed back to your visitor function."]
    pub fn dlist_foreach_udata(
        list: *mut *mut dlistnode,
        func: dlist_foreach_udata_func_type,
        udata: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Like dlist_foreach_udata() but nodes are visited in reverse order."]
    pub fn dlist_foreach_reverse_udata(
        list: *mut *mut dlistnode,
        func: dlist_foreach_udata_func_type,
        udata: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Assuming list is an externalNode list, push a newly allocated list node with"]
    #[doc = " a dlistnodeExternal.ptr = ptr passed."]
    pub fn dlist_pushfront_external(list: *mut *mut dlistnode, ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = " Free a list of externalNode type. The externalNode memory is"]
    #[doc = " free()ed, whatever externalNode.ptr is pointing to is not free()ed."]
    pub fn dlist_free_external(list: *mut *mut dlistnode);
}
pub type dlist_visitor_func_type =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut dlistnode)>;
extern "C" {
    #[doc = " To create a list of bounded length, use this function. Limit is the"]
    #[doc = " maximum length the list can reach. If list nodes have to be removed"]
    #[doc = " to be under this limit then \"f\" is used as a callback to free list"]
    #[doc = " nodes. This allows application specific freeing of a list node, and"]
    #[doc = " the ability to maintain a limit on the length of a list as a simple"]
    #[doc = " one line call."]
    #[doc = ""]
    #[doc = " The current implementation expects you to only be trimming one or"]
    #[doc = " two entries at a time. It will still work for trimming 100 entries"]
    #[doc = " at a single time, but might not be quite as optimized for that case"]
    #[doc = " as it could be."]
    pub fn dlist_trim_to_limit(
        list: *mut *mut dlistnode,
        limit: ::std::os::raw::c_int,
        f: dlist_visitor_func_type,
    );
}
pub type iconv_t = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn iconv_open(
        __tocode: *const ::std::os::raw::c_char,
        __fromcode: *const ::std::os::raw::c_char,
    ) -> iconv_t;
}
extern "C" {
    pub fn iconv(
        __cd: iconv_t,
        __inbuf: *mut *mut ::std::os::raw::c_char,
        __inbytesleft: *mut size_t,
        __outbuf: *mut *mut ::std::os::raw::c_char,
        __outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    pub fn iconv_close(__cd: iconv_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut iconv_local_encoding_name: *mut ::std::os::raw::c_char;
}
pub const encoding_e_usascii: encoding = 0;
pub const encoding_e_iso646_no: encoding = 1;
pub const encoding_e_iso646_se: encoding = 2;
pub const encoding_e_iso8859_1: encoding = 3;
pub const encoding_e_iso8859_2: encoding = 4;
pub const encoding_e_iso8859_3: encoding = 5;
pub const encoding_e_iso8859_4: encoding = 6;
pub const encoding_e_iso8859_5: encoding = 7;
pub const encoding_e_iso8859_6: encoding = 8;
pub const encoding_e_iso8859_7: encoding = 9;
pub const encoding_e_iso8859_8: encoding = 10;
pub const encoding_e_iso8859_9: encoding = 11;
pub const encoding_e_iso8859_10: encoding = 12;
pub const encoding_e_iso8859_11: encoding = 13;
pub const encoding_e_iso8859_13: encoding = 14;
pub const encoding_e_iso8859_14: encoding = 15;
pub const encoding_e_iso8859_15: encoding = 16;
pub const encoding_e_iso8859_16: encoding = 17;
pub const encoding_e_koi8_r: encoding = 18;
pub const encoding_e_jis201: encoding = 19;
pub const encoding_e_win: encoding = 20;
pub const encoding_e_mac: encoding = 21;
pub const encoding_e_user: encoding = 22;
pub const encoding_e_jis: encoding = 23;
pub const encoding_e_jis2: encoding = 24;
pub const encoding_e_jiskorean: encoding = 25;
pub const encoding_e_jisgb: encoding = 26;
pub const encoding_e_sjis: encoding = 27;
pub const encoding_e_euc: encoding = 28;
pub const encoding_e_euckorean: encoding = 29;
pub const encoding_e_eucgb: encoding = 30;
pub const encoding_e_wansung: encoding = 31;
pub const encoding_e_johab: encoding = 32;
pub const encoding_e_big5: encoding = 33;
pub const encoding_e_big5hkscs: encoding = 34;
pub const encoding_e_unicode: encoding = 35;
pub const encoding_e_unicode_backwards: encoding = 36;
pub const encoding_e_utf7: encoding = 37;
pub const encoding_e_utf8: encoding = 38;
pub const encoding_e_ucs4: encoding = 39;
pub const encoding_e_notrans: encoding = 40;
pub const encoding_e_encodingmax: encoding = 41;
pub const encoding_e_unknown: encoding = -1;
pub const encoding_e_first2byte: encoding = 23;
pub type encoding = ::std::os::raw::c_int;
pub const charset_em_none: charset = -1;
pub const charset_em_iso8859_1: charset = 0;
pub const charset_em_iso8859_2: charset = 1;
pub const charset_em_iso8859_3: charset = 2;
pub const charset_em_iso8859_4: charset = 3;
pub const charset_em_iso8859_5: charset = 4;
pub const charset_em_iso8859_6: charset = 5;
pub const charset_em_iso8859_7: charset = 6;
pub const charset_em_iso8859_8: charset = 7;
pub const charset_em_iso8859_9: charset = 8;
pub const charset_em_iso8859_10: charset = 9;
pub const charset_em_iso8859_11: charset = 10;
pub const charset_em_iso8859_13: charset = 11;
pub const charset_em_iso8859_14: charset = 12;
pub const charset_em_iso8859_15: charset = 13;
pub const charset_em_iso8859_16: charset = 14;
pub const charset_em_koi8_r: charset = 15;
pub const charset_em_jis201: charset = 16;
pub const charset_em_win: charset = 17;
pub const charset_em_mac: charset = 18;
pub const charset_em_symbol: charset = 19;
pub const charset_em_zapfding: charset = 20;
pub const charset_em_user: charset = 21;
pub const charset_em_adobestandard: charset = 21;
pub const charset_em_jis208: charset = 22;
pub const charset_em_jis212: charset = 23;
pub const charset_em_ksc5601: charset = 24;
pub const charset_em_gb2312: charset = 25;
pub const charset_em_big5: charset = 26;
pub const charset_em_big5hkscs: charset = 27;
pub const charset_em_johab: charset = 28;
pub const charset_em_unicode: charset = 29;
pub const charset_em_unicode4: charset = 30;
pub const charset_em_gb18030: charset = 31;
pub const charset_em_max: charset = 32;
pub const charset_em_first2byte: charset = 22;
pub const charset_em_last94x94: charset = 25;
pub type charset = ::std::os::raw::c_int;
extern "C" {
    pub static mut local_encoding: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct namemap {
    pub name: *const ::std::os::raw::c_char,
    pub map: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_namemap() {
    assert_eq!(
        ::std::mem::size_of::<namemap>(),
        16usize,
        concat!("Size of: ", stringify!(namemap))
    );
    assert_eq!(
        ::std::mem::align_of::<namemap>(),
        8usize,
        concat!("Alignment of ", stringify!(namemap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<namemap>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(namemap),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<namemap>())).map as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(namemap),
            "::",
            stringify!(map)
        )
    );
}
extern "C" {
    pub static mut encodingnames: [namemap; 0usize];
}
extern "C" {
    pub fn copy(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn copyn(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u_copy(arg1: *const unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn u_copyn(arg1: *const unichar_t, arg2: ::std::os::raw::c_long) -> *mut unichar_t;
}
extern "C" {
    pub fn u_copynallocm(
        pt: *const unichar_t,
        n: ::std::os::raw::c_long,
        m: ::std::os::raw::c_long,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn uc_copyn(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn uc_copy(arg1: *const ::std::os::raw::c_char) -> *mut unichar_t;
}
extern "C" {
    pub fn u_concat(arg1: *const unichar_t, arg2: *const unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn cu_copyn(
        pt: *const unichar_t,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cu_copy(arg1: *const unichar_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn vsmprintf(
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn smprintf(fmt: *const ::std::os::raw::c_char, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uc_strcmp(
        arg1: *const unichar_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn u_strcmp(arg1: *const unichar_t, arg2: *const unichar_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn uc_strncmp(
        arg1: *const unichar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn u_strncmp(
        arg1: *const unichar_t,
        arg2: *const unichar_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn uc_strmatch(
        arg1: *const unichar_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn uc_strnmatch(
        arg1: *const unichar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn u_strnmatch(
        str1: *const unichar_t,
        str2: *const unichar_t,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn u_strmatch(arg1: *const unichar_t, arg2: *const unichar_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strmatch(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnmatch(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uc_strcpy(arg1: *mut unichar_t, arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn cu_strcpy(arg1: *mut ::std::os::raw::c_char, arg2: *const unichar_t);
}
extern "C" {
    pub fn u_strcpy(arg1: *mut unichar_t, arg2: *const unichar_t);
}
extern "C" {
    pub fn u_strncpy(arg1: *mut unichar_t, arg2: *const unichar_t, arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn cu_strncpy(
        to: *mut ::std::os::raw::c_char,
        from: *const unichar_t,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uc_strncpy(
        to: *mut unichar_t,
        from: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Like strncpy but passing a null 'from' will simply null terminate"]
    #[doc = " to[0] to give a blank result rather than a crash."]
    pub fn cc_strncpy(
        to: *mut ::std::os::raw::c_char,
        from: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uc_strcat(arg1: *mut unichar_t, arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uc_strncat(
        arg1: *mut unichar_t,
        arg2: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn cu_strcat(arg1: *mut ::std::os::raw::c_char, arg2: *const unichar_t);
}
extern "C" {
    pub fn cu_strncat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const unichar_t,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn u_strcat(arg1: *mut unichar_t, arg2: *const unichar_t);
}
extern "C" {
    pub fn u_strncat(arg1: *mut unichar_t, arg2: *const unichar_t, len: ::std::os::raw::c_int);
}
extern "C" {
    pub fn u_strlen(arg1: *const unichar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Like strlen() but passing a null pointer gets a 0 length"]
    pub fn c_strlen(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn u_strchr(arg1: *const unichar_t, arg2: unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn u_strrchr(arg1: *const unichar_t, arg2: unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn uc_strstr(arg1: *const unichar_t, arg2: *const ::std::os::raw::c_char)
        -> *mut unichar_t;
}
extern "C" {
    pub fn u_strstr(arg1: *const unichar_t, arg2: *const unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn uc_strstrmatch(
        arg1: *const unichar_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn u_strstrmatch(arg1: *const unichar_t, arg2: *const unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn strstrmatch(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u_to_c(arg1: *const unichar_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn c_to_u(arg1: *const ::std::os::raw::c_char) -> *mut unichar_t;
}
extern "C" {
    pub fn u_strtoul(
        arg1: *const unichar_t,
        arg2: *mut *mut unichar_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn u_strtol(
        arg1: *const unichar_t,
        arg2: *mut *mut unichar_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn u_strtod(arg1: *const unichar_t, arg2: *mut *mut unichar_t) -> f64;
}
extern "C" {
    pub fn c_itostr(v: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstart(
        initial: *const ::std::os::raw::c_char,
        full: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstartmatch(
        initial: *const ::std::os::raw::c_char,
        full: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u_strstartmatch(initial: *const unichar_t, full: *const unichar_t) -> *mut unichar_t;
}
extern "C" {
    pub fn cu_strstartmatch(
        initial: *const ::std::os::raw::c_char,
        full: *const unichar_t,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn utf8_ildb(utf8_text: *mut *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn utf8_idpb(
        utf8_text: *mut ::std::os::raw::c_char,
        ch: uint32,
        flags: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_db(utf8_text: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_ib(utf8_text: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_valid(str_: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utf8_truncatevalid(str_: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn latin1_2_utf8_strcpy(
        utf8buf: *mut ::std::os::raw::c_char,
        lbuf: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn latin1_2_utf8_copy(lbuf: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_2_latin1_copy(
        utf8buf: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_strlen(utf8_str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn utf82u_strlen(utf8_str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn utf8_strncpy(
        to: *mut ::std::os::raw::c_char,
        from: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn def2utf8_copy(from: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf82def_copy(ufrom: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf8_strchr(
        utf8_str: *const ::std::os::raw::c_char,
        search_char: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn utf82U_strncpy(
        ubuf: *mut unichar_t,
        utf8buf: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn utf82u_strcpy(
        ubuf: *mut unichar_t,
        utf8buf: *const ::std::os::raw::c_char,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn utf82u_strcat(ubuf: *mut unichar_t, utf8buf: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn utf82u_copyn(
        utf8buf: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn utf82u_copy(utf8buf: *const ::std::os::raw::c_char) -> *mut unichar_t;
}
extern "C" {
    pub fn u2utf8_strcpy(
        utf8buf: *mut ::std::os::raw::c_char,
        ubuf: *const unichar_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u2utf8_strncpy(
        utf8buf: *mut ::std::os::raw::c_char,
        ubuf: *const unichar_t,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u2utf8_copy(ubuf: *const unichar_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn u2utf8_copyn(
        ubuf: *const unichar_t,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn encoding2u_strncpy(
        uto: *mut unichar_t,
        from: *const ::std::os::raw::c_char,
        n: ::std::os::raw::c_int,
        cs: encoding,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn u2encoding_strncpy(
        to: *mut ::std::os::raw::c_char,
        ufrom: *const unichar_t,
        n: size_t,
        cs: encoding,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn def2u_strncpy(
        uto: *mut unichar_t,
        from: *const ::std::os::raw::c_char,
        n: size_t,
    ) -> *mut unichar_t;
}
extern "C" {
    pub fn u2def_strncpy(
        to: *mut ::std::os::raw::c_char,
        ufrom: *const unichar_t,
        n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn def2u_copy(from: *const ::std::os::raw::c_char) -> *mut unichar_t;
}
extern "C" {
    pub fn u2def_copy(ufrom: *const unichar_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uAllAscii(str_: *const unichar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn AllAscii(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn StripToASCII(utf8_str: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn copytolower(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return true if the haystack plain string ends with the string"]
    #[doc = " needle. Return 0 otherwise."]
    #[doc = ""]
    #[doc = " Needles which are larger than the haystack are handled."]
    #[doc = ""]
    #[doc = " No new strings are allocated, freed, or returned."]
    pub fn endswith(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn endswithi(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn endswithi_partialExtension(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove trailing \\n or \\r from the given string. No memory"]
    #[doc = " allocations are performed, null is injected over these terminators"]
    #[doc = " to trim the string."]
    #[doc = ""]
    #[doc = " This function is designed to be impotent if called with a string"]
    #[doc = " that does not end with \\n or \\r. ie, you don't need to redundantly"]
    #[doc = " check if there is a newline at the end of string and not call here"]
    #[doc = " if there is no newline. You can just call here with any string and"]
    #[doc = " be assured that afterwards there will be no trailing newline or"]
    #[doc = " carrage return character found at the end of the string pointed to"]
    #[doc = " by 'p'."]
    pub fn chomp(p: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return true if the haystack unicode string ends with the string needle."]
    #[doc = " Return 0 otherwise."]
    #[doc = ""]
    #[doc = " Needles which are larger than the haystack are handled."]
    #[doc = ""]
    #[doc = " No new strings are allocated, freed, or returned."]
    pub fn u_endswith(
        haystack: *const unichar_t,
        needle: *const unichar_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn u_startswith(
        haystack: *const unichar_t,
        needle: *const unichar_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uc_startswith(
        haystack: *const unichar_t,
        needle: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " In the string 's' replace all occurances of 'orig' with 'replacement'."]
    #[doc = " If you set free_s to true then the string 's' will be freed by this function."]
    #[doc = " Normally you want to set free_s to 0 to avoid that. The case you will want to"]
    #[doc = " use free_s to 1 is chaining many calls like:"]
    #[doc = ""]
    #[doc = " char* s = copy( input );"]
    #[doc = " s = str_replace_all( s, \"foo\", \"bar\", 1 );"]
    #[doc = " s = str_replace_all( s, \"baz\", \"gah\", 1 );"]
    #[doc = " // use s"]
    #[doc = " free(s);"]
    #[doc = " // no leaks in the above."]
    #[doc = ""]
    #[doc = " Note that 's' is first copied before the first call to replace_all in the above"]
    #[doc = " so it can be freed without concern. This also allows the ordering of replace_all"]
    #[doc = " in the above to be changed without having to worry about the free_s flag."]
    pub fn str_replace_all(
        s: *mut ::std::os::raw::c_char,
        orig: *mut ::std::os::raw::c_char,
        replacement: *mut ::std::os::raw::c_char,
        free_s: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn toint(v: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tostr(v: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lconv {
    pub decimal_point: *mut ::std::os::raw::c_char,
    pub thousands_sep: *mut ::std::os::raw::c_char,
    pub grouping: *mut ::std::os::raw::c_char,
    pub int_curr_symbol: *mut ::std::os::raw::c_char,
    pub currency_symbol: *mut ::std::os::raw::c_char,
    pub mon_decimal_point: *mut ::std::os::raw::c_char,
    pub mon_thousands_sep: *mut ::std::os::raw::c_char,
    pub mon_grouping: *mut ::std::os::raw::c_char,
    pub positive_sign: *mut ::std::os::raw::c_char,
    pub negative_sign: *mut ::std::os::raw::c_char,
    pub int_frac_digits: ::std::os::raw::c_char,
    pub frac_digits: ::std::os::raw::c_char,
    pub p_cs_precedes: ::std::os::raw::c_char,
    pub p_sep_by_space: ::std::os::raw::c_char,
    pub n_cs_precedes: ::std::os::raw::c_char,
    pub n_sep_by_space: ::std::os::raw::c_char,
    pub p_sign_posn: ::std::os::raw::c_char,
    pub n_sign_posn: ::std::os::raw::c_char,
    pub int_p_cs_precedes: ::std::os::raw::c_char,
    pub int_p_sep_by_space: ::std::os::raw::c_char,
    pub int_n_cs_precedes: ::std::os::raw::c_char,
    pub int_n_sep_by_space: ::std::os::raw::c_char,
    pub int_p_sign_posn: ::std::os::raw::c_char,
    pub int_n_sign_posn: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_lconv() {
    assert_eq!(
        ::std::mem::size_of::<lconv>(),
        96usize,
        concat!("Size of: ", stringify!(lconv))
    );
    assert_eq!(
        ::std::mem::align_of::<lconv>(),
        8usize,
        concat!("Alignment of ", stringify!(lconv))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).decimal_point as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(decimal_point)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).thousands_sep as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(thousands_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).grouping as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(grouping)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_curr_symbol as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_curr_symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).currency_symbol as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(currency_symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).mon_decimal_point as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(mon_decimal_point)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).mon_thousands_sep as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(mon_thousands_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).mon_grouping as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(mon_grouping)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).positive_sign as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(positive_sign)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).negative_sign as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(negative_sign)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_frac_digits as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_frac_digits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).frac_digits as *const _ as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(frac_digits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).p_cs_precedes as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).p_sep_by_space as *const _ as usize },
        83usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).n_cs_precedes as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).n_sep_by_space as *const _ as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).p_sign_posn as *const _ as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).n_sign_posn as *const _ as usize },
        87usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(n_sign_posn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_p_cs_precedes as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_p_sep_by_space as *const _ as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_n_cs_precedes as *const _ as usize },
        90usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_n_sep_by_space as *const _ as usize },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_p_sign_posn as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lconv>())).int_n_sign_posn as *const _ as usize },
        93usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv),
            "::",
            stringify!(int_n_sign_posn)
        )
    );
}
extern "C" {
    pub fn setlocale(
        __category: ::std::os::raw::c_int,
        __locale: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn localeconv() -> *mut lconv;
}
extern "C" {
    pub fn newlocale(
        __category_mask: ::std::os::raw::c_int,
        __locale: *const ::std::os::raw::c_char,
        __base: locale_t,
    ) -> locale_t;
}
extern "C" {
    pub fn duplocale(__dataset: locale_t) -> locale_t;
}
extern "C" {
    pub fn freelocale(__dataset: locale_t);
}
extern "C" {
    pub fn uselocale(__dataset: locale_t) -> locale_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bezctx {
    _unused: [u8; 0],
}
pub type bezctx = _bezctx;
extern "C" {
    pub fn new_bezctx() -> *mut bezctx;
}
extern "C" {
    pub fn bezctx_moveto(bc: *mut bezctx, x: f64, y: f64, is_open: ::std::os::raw::c_int);
}
extern "C" {
    pub fn bezctx_lineto(bc: *mut bezctx, x: f64, y: f64);
}
extern "C" {
    pub fn bezctx_quadto(bc: *mut bezctx, x1: f64, y1: f64, x2: f64, y2: f64);
}
extern "C" {
    pub fn bezctx_curveto(bc: *mut bezctx, x1: f64, y1: f64, x2: f64, y2: f64, x3: f64, y3: f64);
}
extern "C" {
    pub fn bezctx_mark_knot(bc: *mut bezctx, knot_idx: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spiro_cp {
    pub x: f64,
    pub y: f64,
    pub ty: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spiro_cp() {
    assert_eq!(
        ::std::mem::size_of::<spiro_cp>(),
        24usize,
        concat!("Size of: ", stringify!(spiro_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<spiro_cp>(),
        8usize,
        concat!("Alignment of ", stringify!(spiro_cp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_cp>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_cp),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_cp>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_cp),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_cp>())).ty as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_cp),
            "::",
            stringify!(ty)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spiro_seg_s {
    pub x: f64,
    pub y: f64,
    pub ty: ::std::os::raw::c_char,
    pub bend_th: f64,
    pub ks: [f64; 4usize],
    pub seg_ch: f64,
    pub seg_th: f64,
    pub l: f64,
}
#[test]
fn bindgen_test_layout_spiro_seg_s() {
    assert_eq!(
        ::std::mem::size_of::<spiro_seg_s>(),
        88usize,
        concat!("Size of: ", stringify!(spiro_seg_s))
    );
    assert_eq!(
        ::std::mem::align_of::<spiro_seg_s>(),
        8usize,
        concat!("Alignment of ", stringify!(spiro_seg_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).ty as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(ty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).bend_th as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(bend_th)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).ks as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(ks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).seg_ch as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(seg_ch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).seg_th as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(seg_th)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<spiro_seg_s>())).l as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(spiro_seg_s),
            "::",
            stringify!(l)
        )
    );
}
pub type spiro_seg = spiro_seg_s;
extern "C" {
    pub fn run_spiro(src: *const spiro_cp, n: ::std::os::raw::c_int) -> *mut spiro_seg;
}
extern "C" {
    pub fn free_spiro(s: *mut spiro_seg);
}
extern "C" {
    pub fn spiro_to_bpath(s: *const spiro_seg, n: ::std::os::raw::c_int, bc: *mut bezctx);
}
extern "C" {
    pub fn get_knot_th(s: *const spiro_seg, i: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn run_spiro0(
        src: *const spiro_cp,
        dm: *mut f64,
        ncq: ::std::os::raw::c_int,
        n: ::std::os::raw::c_int,
    ) -> *mut spiro_seg;
}
extern "C" {
    pub fn spiro_to_bpath0(
        src: *const spiro_cp,
        s: *const spiro_seg,
        dm: *mut f64,
        ncq: ::std::os::raw::c_int,
        n: ::std::os::raw::c_int,
        bc: *mut bezctx,
    );
}
extern "C" {
    pub fn spiroreverse(src: *mut spiro_cp, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LibSpiroVersion() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TaggedSpiroCPsToBezier(spiros: *mut spiro_cp, bc: *mut bezctx);
}
extern "C" {
    pub fn SpiroCPsToBezier(
        spiros: *mut spiro_cp,
        n: ::std::os::raw::c_int,
        isclosed: ::std::os::raw::c_int,
        bc: *mut bezctx,
    );
}
extern "C" {
    pub fn TaggedSpiroCPsToBezier0(spiros: *mut spiro_cp, bc: *mut bezctx)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SpiroCPsToBezier0(
        spiros: *mut spiro_cp,
        n: ::std::os::raw::c_int,
        isclosed: ::std::os::raw::c_int,
        bc: *mut bezctx,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TaggedSpiroCPsToBezier1(
        spiros: *mut spiro_cp,
        bc: *mut bezctx,
        done: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn SpiroCPsToBezier1(
        spiros: *mut spiro_cp,
        n: ::std::os::raw::c_int,
        isclosed: ::std::os::raw::c_int,
        bc: *mut bezctx,
        done: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn TaggedSpiroCPsToBezier2(
        spiros: *mut spiro_cp,
        ncq: ::std::os::raw::c_int,
        bc: *mut bezctx,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SpiroCPsToBezier2(
        spiros: *mut spiro_cp,
        n: ::std::os::raw::c_int,
        ncq: ::std::os::raw::c_int,
        isclosed: ::std::os::raw::c_int,
        bc: *mut bezctx,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipoint {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ipoint() {
    assert_eq!(
        ::std::mem::size_of::<ipoint>(),
        8usize,
        concat!("Size of: ", stringify!(ipoint))
    );
    assert_eq!(
        ::std::mem::align_of::<ipoint>(),
        4usize,
        concat!("Alignment of ", stringify!(ipoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipoint>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ipoint), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipoint>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ipoint), "::", stringify!(y))
    );
}
pub type IPoint = ipoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct basepoint {
    pub x: f64,
    pub y: f64,
}
#[test]
fn bindgen_test_layout_basepoint() {
    assert_eq!(
        ::std::mem::size_of::<basepoint>(),
        16usize,
        concat!("Size of: ", stringify!(basepoint))
    );
    assert_eq!(
        ::std::mem::align_of::<basepoint>(),
        8usize,
        concat!("Alignment of ", stringify!(basepoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<basepoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(basepoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<basepoint>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(basepoint),
            "::",
            stringify!(y)
        )
    );
}
pub type BasePoint = basepoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dbasepoint {
    pub x: f64,
    pub y: f64,
}
#[test]
fn bindgen_test_layout_dbasepoint() {
    assert_eq!(
        ::std::mem::size_of::<dbasepoint>(),
        16usize,
        concat!("Size of: ", stringify!(dbasepoint))
    );
    assert_eq!(
        ::std::mem::align_of::<dbasepoint>(),
        8usize,
        concat!("Alignment of ", stringify!(dbasepoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbasepoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dbasepoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbasepoint>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dbasepoint),
            "::",
            stringify!(y)
        )
    );
}
pub type DBasePoint = dbasepoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dbounds {
    pub minx: f64,
    pub maxx: f64,
    pub miny: f64,
    pub maxy: f64,
}
#[test]
fn bindgen_test_layout_dbounds() {
    assert_eq!(
        ::std::mem::size_of::<dbounds>(),
        32usize,
        concat!("Size of: ", stringify!(dbounds))
    );
    assert_eq!(
        ::std::mem::align_of::<dbounds>(),
        8usize,
        concat!("Alignment of ", stringify!(dbounds))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbounds>())).minx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dbounds),
            "::",
            stringify!(minx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbounds>())).maxx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dbounds),
            "::",
            stringify!(maxx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbounds>())).miny as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dbounds),
            "::",
            stringify!(miny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dbounds>())).maxy as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dbounds),
            "::",
            stringify!(maxy)
        )
    );
}
pub type DBounds = dbounds;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibounds {
    pub minx: ::std::os::raw::c_int,
    pub maxx: ::std::os::raw::c_int,
    pub miny: ::std::os::raw::c_int,
    pub maxy: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ibounds() {
    assert_eq!(
        ::std::mem::size_of::<ibounds>(),
        16usize,
        concat!("Size of: ", stringify!(ibounds))
    );
    assert_eq!(
        ::std::mem::align_of::<ibounds>(),
        4usize,
        concat!("Alignment of ", stringify!(ibounds))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibounds>())).minx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ibounds),
            "::",
            stringify!(minx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibounds>())).maxx as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ibounds),
            "::",
            stringify!(maxx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibounds>())).miny as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ibounds),
            "::",
            stringify!(miny)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibounds>())).maxy as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ibounds),
            "::",
            stringify!(maxy)
        )
    );
}
pub type IBounds = ibounds;
pub const val_type_v_int: val_type = 0;
pub const val_type_v_real: val_type = 1;
pub const val_type_v_str: val_type = 2;
pub const val_type_v_unicode: val_type = 3;
pub const val_type_v_lval: val_type = 4;
pub const val_type_v_arr: val_type = 5;
pub const val_type_v_arrfree: val_type = 6;
pub const val_type_v_void: val_type = 7;
pub type val_type = ::std::os::raw::c_uint;
pub const val_flags_vf_none: val_flags = 0;
pub const val_flags_vf_dontfree: val_flags = 2;
pub type val_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct val {
    pub type_: val_type,
    pub flags: val_flags,
    pub u: val__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union val__bindgen_ty_1 {
    pub ival: ::std::os::raw::c_int,
    pub fval: f64,
    pub sval: *mut ::std::os::raw::c_char,
    pub lval: *mut val,
    pub aval: *mut array,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_val__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<val__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(val__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<val__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(val__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val__bindgen_ty_1>())).ival as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val__bindgen_ty_1),
            "::",
            stringify!(ival)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val__bindgen_ty_1>())).fval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val__bindgen_ty_1),
            "::",
            stringify!(fval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val__bindgen_ty_1>())).sval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val__bindgen_ty_1),
            "::",
            stringify!(sval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val__bindgen_ty_1>())).lval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val__bindgen_ty_1),
            "::",
            stringify!(lval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val__bindgen_ty_1>())).aval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val__bindgen_ty_1),
            "::",
            stringify!(aval)
        )
    );
}
#[test]
fn bindgen_test_layout_val() {
    assert_eq!(
        ::std::mem::size_of::<val>(),
        16usize,
        concat!("Size of: ", stringify!(val))
    );
    assert_eq!(
        ::std::mem::align_of::<val>(),
        8usize,
        concat!("Alignment of ", stringify!(val))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(val),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(val),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<val>())).u as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(val), "::", stringify!(u))
    );
}
pub type Val = val;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct psdict {
    pub cnt: ::std::os::raw::c_int,
    pub next: ::std::os::raw::c_int,
    pub keys: *mut *mut ::std::os::raw::c_char,
    pub values: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_psdict() {
    assert_eq!(
        ::std::mem::size_of::<psdict>(),
        24usize,
        concat!("Size of: ", stringify!(psdict))
    );
    assert_eq!(
        ::std::mem::align_of::<psdict>(),
        8usize,
        concat!("Alignment of ", stringify!(psdict))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psdict>())).cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(psdict),
            "::",
            stringify!(cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psdict>())).next as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(psdict),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psdict>())).keys as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(psdict),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<psdict>())).values as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(psdict),
            "::",
            stringify!(values)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pschars {
    pub cnt: ::std::os::raw::c_int,
    pub next: ::std::os::raw::c_int,
    pub keys: *mut *mut ::std::os::raw::c_char,
    pub values: *mut *mut uint8,
    pub lens: *mut ::std::os::raw::c_int,
    pub bias: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pschars() {
    assert_eq!(
        ::std::mem::size_of::<pschars>(),
        40usize,
        concat!("Size of: ", stringify!(pschars))
    );
    assert_eq!(
        ::std::mem::align_of::<pschars>(),
        8usize,
        concat!("Alignment of ", stringify!(pschars))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).next as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).keys as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).values as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).lens as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(lens)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pschars>())).bias as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pschars),
            "::",
            stringify!(bias)
        )
    );
}
pub const linejoin_lj_miter: linejoin = 0;
pub const linejoin_lj_round: linejoin = 1;
pub const linejoin_lj_bevel: linejoin = 2;
pub const linejoin_lj_miterclip: linejoin = 3;
pub const linejoin_lj_nib: linejoin = 4;
pub const linejoin_lj_arcs: linejoin = 5;
pub const linejoin_lj_inherited: linejoin = 6;
pub type linejoin = ::std::os::raw::c_uint;
pub const linecap_lc_butt: linecap = 0;
pub const linecap_lc_round: linecap = 1;
pub const linecap_lc_square: linecap = 2;
pub const linecap_lc_nib: linecap = 3;
pub const linecap_lc_bevel: linecap = 4;
pub const linecap_lc_inherited: linecap = 5;
pub type linecap = ::std::os::raw::c_uint;
pub const stroke_rmov_srmov_layer: stroke_rmov = 0;
pub const stroke_rmov_srmov_contour: stroke_rmov = 1;
pub const stroke_rmov_srmov_none: stroke_rmov = 2;
pub type stroke_rmov = ::std::os::raw::c_uint;
pub const stroke_arclimit_sal_auto: stroke_arclimit = 0;
pub const stroke_arclimit_sal_svg2: stroke_arclimit = 1;
pub const stroke_arclimit_sal_ratio: stroke_arclimit = 2;
pub type stroke_arclimit = ::std::os::raw::c_uint;
pub const spreadMethod_sm_pad: spreadMethod = 0;
pub const spreadMethod_sm_reflect: spreadMethod = 1;
pub const spreadMethod_sm_repeat: spreadMethod = 2;
pub type spreadMethod = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grad_stops {
    pub offset: f64,
    pub col: uint32,
    pub opacity: f64,
}
#[test]
fn bindgen_test_layout_grad_stops() {
    assert_eq!(
        ::std::mem::size_of::<grad_stops>(),
        24usize,
        concat!("Size of: ", stringify!(grad_stops))
    );
    assert_eq!(
        ::std::mem::align_of::<grad_stops>(),
        8usize,
        concat!("Alignment of ", stringify!(grad_stops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grad_stops>())).offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grad_stops),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grad_stops>())).col as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grad_stops),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grad_stops>())).opacity as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(grad_stops),
            "::",
            stringify!(opacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gradient {
    pub start: BasePoint,
    pub stop: BasePoint,
    pub radius: f64,
    pub sm: spreadMethod,
    pub stop_cnt: ::std::os::raw::c_int,
    pub grad_stops: *mut grad_stops,
}
#[test]
fn bindgen_test_layout_gradient() {
    assert_eq!(
        ::std::mem::size_of::<gradient>(),
        56usize,
        concat!("Size of: ", stringify!(gradient))
    );
    assert_eq!(
        ::std::mem::align_of::<gradient>(),
        8usize,
        concat!("Alignment of ", stringify!(gradient))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).stop as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).radius as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).sm as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(sm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).stop_cnt as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(stop_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gradient>())).grad_stops as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(gradient),
            "::",
            stringify!(grad_stops)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pattern {
    pub pattern: *mut ::std::os::raw::c_char,
    pub width: f64,
    pub height: f64,
    pub transform: [f64; 6usize],
    pub pat: *mut bdfchar,
    pub invtrans: [f64; 6usize],
    pub bminx: ::std::os::raw::c_int,
    pub bminy: ::std::os::raw::c_int,
    pub bwidth: ::std::os::raw::c_int,
    pub bheight: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pattern() {
    assert_eq!(
        ::std::mem::size_of::<pattern>(),
        144usize,
        concat!("Size of: ", stringify!(pattern))
    );
    assert_eq!(
        ::std::mem::align_of::<pattern>(),
        8usize,
        concat!("Alignment of ", stringify!(pattern))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).pattern as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).height as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).transform as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(transform)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).pat as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(pat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).invtrans as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(invtrans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).bminx as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(bminx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).bminy as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(bminy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).bwidth as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(bwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pattern>())).bheight as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(pattern),
            "::",
            stringify!(bheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct brush {
    pub col: uint32,
    pub opacity: f32,
    pub pattern: *mut pattern,
    pub gradient: *mut gradient,
}
#[test]
fn bindgen_test_layout_brush() {
    assert_eq!(
        ::std::mem::size_of::<brush>(),
        24usize,
        concat!("Size of: ", stringify!(brush))
    );
    assert_eq!(
        ::std::mem::align_of::<brush>(),
        8usize,
        concat!("Alignment of ", stringify!(brush))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<brush>())).col as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(brush),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<brush>())).opacity as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(brush),
            "::",
            stringify!(opacity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<brush>())).pattern as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(brush),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<brush>())).gradient as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(brush),
            "::",
            stringify!(gradient)
        )
    );
}
pub type DashType = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pen {
    pub brush: brush,
    pub linejoin: uint8,
    pub linecap: uint8,
    pub width: f32,
    pub trans: [f64; 4usize],
    pub dashes: [DashType; 8usize],
}
#[test]
fn bindgen_test_layout_pen() {
    assert_eq!(
        ::std::mem::size_of::<pen>(),
        72usize,
        concat!("Size of: ", stringify!(pen))
    );
    assert_eq!(
        ::std::mem::align_of::<pen>(),
        8usize,
        concat!("Alignment of ", stringify!(pen))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).brush as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(brush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).linejoin as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(linejoin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).linecap as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(linecap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).width as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).trans as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(trans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pen>())).dashes as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pen),
            "::",
            stringify!(dashes)
        )
    );
}
pub const si_type_si_round: si_type = 0;
pub const si_type_si_calligraphic: si_type = 1;
pub const si_type_si_nib: si_type = 2;
pub const si_type_si_centerline: si_type = 3;
pub type si_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct strokeinfo {
    pub width: f64,
    pub join: linejoin,
    pub cap: linecap,
    pub stroke_type: si_type,
    pub rmov: stroke_rmov,
    pub al: stroke_arclimit,
    pub removeinternal: ::std::os::raw::c_int,
    pub removeexternal: ::std::os::raw::c_int,
    pub simplify: ::std::os::raw::c_int,
    pub extrema: ::std::os::raw::c_int,
    pub leave_users_center: ::std::os::raw::c_int,
    pub jlrelative: ::std::os::raw::c_int,
    pub ecrelative: ::std::os::raw::c_int,
    pub penangle: f64,
    pub height: f64,
    pub extendcap: f64,
    pub joinlimit: f64,
    pub accuracy_target: f64,
    pub nib: *mut splinepointlist,
    pub radius2: f64,
    pub pressure1: ::std::os::raw::c_int,
    pub pressure2: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_void,
    pub factor: ::std::option::Option<
        unsafe extern "C" fn(data: *mut ::std::os::raw::c_void, spline: *mut spline, t: f64) -> f64,
    >,
}
#[test]
fn bindgen_test_layout_strokeinfo() {
    assert_eq!(
        ::std::mem::size_of::<strokeinfo>(),
        136usize,
        concat!("Size of: ", stringify!(strokeinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<strokeinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(strokeinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).join as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).cap as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(cap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).stroke_type as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(stroke_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).rmov as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(rmov)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).al as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(al)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).removeinternal as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(removeinternal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).removeexternal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(removeexternal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).simplify as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(simplify)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).extrema as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(extrema)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).leave_users_center as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(leave_users_center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).jlrelative as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(jlrelative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).ecrelative as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(ecrelative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).penangle as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(penangle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).height as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).extendcap as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(extendcap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).joinlimit as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(joinlimit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).accuracy_target as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(accuracy_target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).nib as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(nib)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).radius2 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(radius2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).pressure1 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(pressure1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).pressure2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(pressure2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).data as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<strokeinfo>())).factor as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(strokeinfo),
            "::",
            stringify!(factor)
        )
    );
}
pub type StrokeInfo = strokeinfo;
extern "C" {
    pub fn InitializeStrokeInfo(sip: *mut StrokeInfo) -> *mut StrokeInfo;
}
extern "C" {
    pub fn SITranslatePSArgs(sip: *mut StrokeInfo, lj: linejoin, lc: linecap);
}
pub const overlap_type_over_remove: overlap_type = 0;
pub const overlap_type_over_rmselected: overlap_type = 1;
pub const overlap_type_over_intersect: overlap_type = 2;
pub const overlap_type_over_intersel: overlap_type = 3;
pub const overlap_type_over_exclude: overlap_type = 4;
pub const overlap_type_over_findinter: overlap_type = 5;
pub const overlap_type_over_fisel: overlap_type = 6;
pub type overlap_type = ::std::os::raw::c_uint;
pub const simpify_flags_sf_cleanup: simpify_flags = -1;
pub const simpify_flags_sf_normal: simpify_flags = 0;
pub const simpify_flags_sf_ignoreslopes: simpify_flags = 1;
pub const simpify_flags_sf_ignoreextremum: simpify_flags = 2;
pub const simpify_flags_sf_smoothcurves: simpify_flags = 4;
pub const simpify_flags_sf_choosehv: simpify_flags = 8;
pub const simpify_flags_sf_forcelines: simpify_flags = 16;
pub const simpify_flags_sf_nearlyhvlines: simpify_flags = 32;
pub const simpify_flags_sf_mergelines: simpify_flags = 64;
pub const simpify_flags_sf_setstart2extremum: simpify_flags = 128;
pub const simpify_flags_sf_rmsingletonpoints: simpify_flags = 256;
pub type simpify_flags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct simplifyinfo {
    pub flags: ::std::os::raw::c_int,
    pub err: f64,
    pub tan_bounds: f64,
    pub linefixup: f64,
    pub linelenmax: f64,
    pub set_as_default: ::std::os::raw::c_int,
    pub check_selected_contours: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_simplifyinfo() {
    assert_eq!(
        ::std::mem::size_of::<simplifyinfo>(),
        48usize,
        concat!("Size of: ", stringify!(simplifyinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<simplifyinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(simplifyinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).err as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).tan_bounds as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(tan_bounds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).linefixup as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(linefixup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).linelenmax as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(linelenmax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<simplifyinfo>())).set_as_default as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(set_as_default)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<simplifyinfo>())).check_selected_contours as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(simplifyinfo),
            "::",
            stringify!(check_selected_contours)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hsquash {
    pub lsb_percent: f64,
    pub stem_percent: f64,
    pub counter_percent: f64,
    pub rsb_percent: f64,
}
#[test]
fn bindgen_test_layout_hsquash() {
    assert_eq!(
        ::std::mem::size_of::<hsquash>(),
        32usize,
        concat!("Size of: ", stringify!(hsquash))
    );
    assert_eq!(
        ::std::mem::align_of::<hsquash>(),
        8usize,
        concat!("Alignment of ", stringify!(hsquash))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hsquash>())).lsb_percent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hsquash),
            "::",
            stringify!(lsb_percent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hsquash>())).stem_percent as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hsquash),
            "::",
            stringify!(stem_percent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hsquash>())).counter_percent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hsquash),
            "::",
            stringify!(counter_percent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hsquash>())).rsb_percent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(hsquash),
            "::",
            stringify!(rsb_percent)
        )
    );
}
pub const serif_type_srf_flat: serif_type = 0;
pub const serif_type_srf_simpleslant: serif_type = 1;
pub const serif_type_srf_complexslant: serif_type = 2;
pub type serif_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct italicinfo {
    pub italic_angle: f64,
    pub xheight_percent: f64,
    pub lc: hsquash,
    pub uc: hsquash,
    pub neither: hsquash,
    pub secondary_serif: serif_type,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub tan_ia: f64,
    pub x_height: f64,
    pub pq_depth: f64,
    pub ascender_height: f64,
    pub emsize: f64,
    pub order2: ::std::os::raw::c_int,
    pub sf: *mut splinefont,
    pub layer: ::std::os::raw::c_int,
    pub serif_extent: f64,
    pub serif_height: f64,
    pub f_start: *mut splinepoint,
    pub f_end: *mut splinepoint,
    pub ff_start1: *mut splinepoint,
    pub ff_end1: *mut splinepoint,
    pub ff_start2: *mut splinepoint,
    pub ff_end2: *mut splinepoint,
    pub f_height: f64,
    pub ff_height: f64,
}
#[test]
fn bindgen_test_layout_italicinfo() {
    assert_eq!(
        ::std::mem::size_of::<italicinfo>(),
        264usize,
        concat!("Size of: ", stringify!(italicinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<italicinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(italicinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).italic_angle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(italic_angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).xheight_percent as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(xheight_percent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).lc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(lc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).uc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(uc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).neither as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(neither)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).secondary_serif as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(secondary_serif)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).tan_ia as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(tan_ia)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).x_height as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(x_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).pq_depth as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(pq_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ascender_height as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ascender_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).emsize as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(emsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).order2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(order2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).sf as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(sf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).layer as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(layer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).serif_extent as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(serif_extent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).serif_height as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(serif_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).f_start as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(f_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).f_end as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(f_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ff_start1 as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ff_start1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ff_end1 as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ff_end1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ff_start2 as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ff_start2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ff_end2 as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ff_end2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).f_height as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(f_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<italicinfo>())).ff_height as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(italicinfo),
            "::",
            stringify!(ff_height)
        )
    );
}
impl italicinfo {
    #[inline]
    pub fn transform_bottom_serifs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transform_bottom_serifs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_top_xh_serifs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transform_top_xh_serifs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_top_as_serifs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transform_top_as_serifs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_diagon_serifs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transform_diagon_serifs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn a_from_d(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_a_from_d(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn f_long_tail(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_f_long_tail(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn f_rotate_top(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_f_rotate_top(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pq_deserif(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pq_deserif(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_phi(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_phi(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_i(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_i(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_pi(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_pi(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_te(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_te(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_sha(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_sha(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_dje(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_dje(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cyrl_dzhe(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cyrl_dzhe(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        transform_bottom_serifs: ::std::os::raw::c_uint,
        transform_top_xh_serifs: ::std::os::raw::c_uint,
        transform_top_as_serifs: ::std::os::raw::c_uint,
        transform_diagon_serifs: ::std::os::raw::c_uint,
        a_from_d: ::std::os::raw::c_uint,
        f_long_tail: ::std::os::raw::c_uint,
        f_rotate_top: ::std::os::raw::c_uint,
        pq_deserif: ::std::os::raw::c_uint,
        cyrl_phi: ::std::os::raw::c_uint,
        cyrl_i: ::std::os::raw::c_uint,
        cyrl_pi: ::std::os::raw::c_uint,
        cyrl_te: ::std::os::raw::c_uint,
        cyrl_sha: ::std::os::raw::c_uint,
        cyrl_dje: ::std::os::raw::c_uint,
        cyrl_dzhe: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let transform_bottom_serifs: u32 =
                unsafe { ::std::mem::transmute(transform_bottom_serifs) };
            transform_bottom_serifs as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let transform_top_xh_serifs: u32 =
                unsafe { ::std::mem::transmute(transform_top_xh_serifs) };
            transform_top_xh_serifs as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let transform_top_as_serifs: u32 =
                unsafe { ::std::mem::transmute(transform_top_as_serifs) };
            transform_top_as_serifs as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let transform_diagon_serifs: u32 =
                unsafe { ::std::mem::transmute(transform_diagon_serifs) };
            transform_diagon_serifs as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let a_from_d: u32 = unsafe { ::std::mem::transmute(a_from_d) };
            a_from_d as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let f_long_tail: u32 = unsafe { ::std::mem::transmute(f_long_tail) };
            f_long_tail as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let f_rotate_top: u32 = unsafe { ::std::mem::transmute(f_rotate_top) };
            f_rotate_top as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let pq_deserif: u32 = unsafe { ::std::mem::transmute(pq_deserif) };
            pq_deserif as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let cyrl_phi: u32 = unsafe { ::std::mem::transmute(cyrl_phi) };
            cyrl_phi as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let cyrl_i: u32 = unsafe { ::std::mem::transmute(cyrl_i) };
            cyrl_i as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let cyrl_pi: u32 = unsafe { ::std::mem::transmute(cyrl_pi) };
            cyrl_pi as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let cyrl_te: u32 = unsafe { ::std::mem::transmute(cyrl_te) };
            cyrl_te as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let cyrl_sha: u32 = unsafe { ::std::mem::transmute(cyrl_sha) };
            cyrl_sha as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let cyrl_dje: u32 = unsafe { ::std::mem::transmute(cyrl_dje) };
            cyrl_dje as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let cyrl_dzhe: u32 = unsafe { ::std::mem::transmute(cyrl_dzhe) };
            cyrl_dzhe as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ItalicInfo = italicinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bluedata {
    pub xheight: f64,
    pub xheighttop: f64,
    pub caph: f64,
    pub caphtop: f64,
    pub base: f64,
    pub basebelow: f64,
    pub ascent: f64,
    pub descent: f64,
    pub numh: f64,
    pub numhtop: f64,
    pub bluecnt: ::std::os::raw::c_int,
    pub blues: [[f64; 2usize]; 12usize],
}
#[test]
fn bindgen_test_layout_bluedata() {
    assert_eq!(
        ::std::mem::size_of::<bluedata>(),
        280usize,
        concat!("Size of: ", stringify!(bluedata))
    );
    assert_eq!(
        ::std::mem::align_of::<bluedata>(),
        8usize,
        concat!("Alignment of ", stringify!(bluedata))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).xheight as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(xheight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).xheighttop as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(xheighttop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).caph as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(caph)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).caphtop as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(caphtop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).basebelow as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(basebelow)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).ascent as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(ascent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).descent as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(descent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).numh as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(numh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).numhtop as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(numhtop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).bluecnt as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(bluecnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bluedata>())).blues as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(bluedata),
            "::",
            stringify!(blues)
        )
    );
}
pub type BlueData = bluedata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bdffloat {
    pub xmin: int16,
    pub xmax: int16,
    pub ymin: int16,
    pub ymax: int16,
    pub bytes_per_line: int16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub depth: uint8,
    pub bitmap: *mut uint8,
}
#[test]
fn bindgen_test_layout_bdffloat() {
    assert_eq!(
        ::std::mem::size_of::<bdffloat>(),
        24usize,
        concat!("Size of: ", stringify!(bdffloat))
    );
    assert_eq!(
        ::std::mem::align_of::<bdffloat>(),
        8usize,
        concat!("Alignment of ", stringify!(bdffloat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).xmin as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(xmin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).xmax as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(xmax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).ymin as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(ymin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).ymax as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(ymax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).bytes_per_line as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(bytes_per_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).depth as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bdffloat>())).bitmap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bdffloat),
            "::",
            stringify!(bitmap)
        )
    );
}
impl bdffloat {
    #[inline]
    pub fn byte_data(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_byte_data(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        byte_data: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let byte_data: u32 = unsafe { ::std::mem::transmute(byte_data) };
            byte_data as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type BDFFloat = bdffloat;
pub const otlookup_type_ot_undef: otlookup_type = 0;
pub const otlookup_type_gsub_start: otlookup_type = 0;
pub const otlookup_type_gsub_single: otlookup_type = 1;
pub const otlookup_type_gsub_multiple: otlookup_type = 2;
pub const otlookup_type_gsub_alternate: otlookup_type = 3;
pub const otlookup_type_gsub_ligature: otlookup_type = 4;
pub const otlookup_type_gsub_context: otlookup_type = 5;
pub const otlookup_type_gsub_contextchain: otlookup_type = 6;
pub const otlookup_type_gsub_reversecchain: otlookup_type = 8;
pub const otlookup_type_morx_indic: otlookup_type = 253;
pub const otlookup_type_morx_context: otlookup_type = 254;
pub const otlookup_type_morx_insert: otlookup_type = 255;
pub const otlookup_type_gpos_start: otlookup_type = 256;
pub const otlookup_type_gpos_single: otlookup_type = 257;
pub const otlookup_type_gpos_pair: otlookup_type = 258;
pub const otlookup_type_gpos_cursive: otlookup_type = 259;
pub const otlookup_type_gpos_mark2base: otlookup_type = 260;
pub const otlookup_type_gpos_mark2ligature: otlookup_type = 261;
pub const otlookup_type_gpos_mark2mark: otlookup_type = 262;
pub const otlookup_type_gpos_context: otlookup_type = 263;
pub const otlookup_type_gpos_contextchain: otlookup_type = 264;
pub const otlookup_type_kern_statemachine: otlookup_type = 511;
pub type otlookup_type = ::std::os::raw::c_uint;
pub const otlookup_typemasks_gsub_single_mask: otlookup_typemasks = 1;
pub const otlookup_typemasks_gsub_multiple_mask: otlookup_typemasks = 2;
pub const otlookup_typemasks_gsub_alternate_mask: otlookup_typemasks = 4;
pub const otlookup_typemasks_gsub_ligature_mask: otlookup_typemasks = 8;
pub const otlookup_typemasks_gsub_context_mask: otlookup_typemasks = 16;
pub const otlookup_typemasks_gsub_contextchain_mask: otlookup_typemasks = 32;
pub const otlookup_typemasks_gsub_reversecchain_mask: otlookup_typemasks = 64;
pub const otlookup_typemasks_morx_indic_mask: otlookup_typemasks = 128;
pub const otlookup_typemasks_morx_context_mask: otlookup_typemasks = 256;
pub const otlookup_typemasks_morx_insert_mask: otlookup_typemasks = 512;
pub const otlookup_typemasks_gpos_single_mask: otlookup_typemasks = 1024;
pub const otlookup_typemasks_gpos_pair_mask: otlookup_typemasks = 2048;
pub const otlookup_typemasks_gpos_cursive_mask: otlookup_typemasks = 4096;
pub const otlookup_typemasks_gpos_mark2base_mask: otlookup_typemasks = 8192;
pub const otlookup_typemasks_gpos_mark2ligature_mask: otlookup_typemasks = 16384;
pub const otlookup_typemasks_gpos_mark2mark_mask: otlookup_typemasks = 32768;
pub const otlookup_typemasks_gpos_context_mask: otlookup_typemasks = 65536;
pub const otlookup_typemasks_gpos_contextchain_mask: otlookup_typemasks = 131072;
pub const otlookup_typemasks_kern_statemachine_mask: otlookup_typemasks = 262144;
pub type otlookup_typemasks = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct scriptlanglist {
    pub script: uint32,
    pub langs: [uint32; 4usize],
    pub morelangs: *mut uint32,
    pub lang_cnt: ::std::os::raw::c_int,
    pub next: *mut scriptlanglist,
}
#[test]
fn bindgen_test_layout_scriptlanglist() {
    assert_eq!(
        ::std::mem::size_of::<scriptlanglist>(),
        48usize,
        concat!("Size of: ", stringify!(scriptlanglist))
    );
    assert_eq!(
        ::std::mem::align_of::<scriptlanglist>(),
        8usize,
        concat!("Alignment of ", stringify!(scriptlanglist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<scriptlanglist>())).script as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(scriptlanglist),
            "::",
            stringify!(script)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<scriptlanglist>())).langs as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(scriptlanglist),
            "::",
            stringify!(langs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<scriptlanglist>())).morelangs as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(scriptlanglist),
            "::",
            stringify!(morelangs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<scriptlanglist>())).lang_cnt as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(scriptlanglist),
            "::",
            stringify!(lang_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<scriptlanglist>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(scriptlanglist),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct opentype_feature_friendlynames {
    pub tag: uint32,
    pub tagstr: *mut ::std::os::raw::c_char,
    pub friendlyname: *mut ::std::os::raw::c_char,
    pub masks: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_opentype_feature_friendlynames() {
    assert_eq!(
        ::std::mem::size_of::<opentype_feature_friendlynames>(),
        32usize,
        concat!("Size of: ", stringify!(opentype_feature_friendlynames))
    );
    assert_eq!(
        ::std::mem::align_of::<opentype_feature_friendlynames>(),
        8usize,
        concat!("Alignment of ", stringify!(opentype_feature_friendlynames))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<opentype_feature_friendlynames>())).tag as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(opentype_feature_friendlynames),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<opentype_feature_friendlynames>())).tagstr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(opentype_feature_friendlynames),
            "::",
            stringify!(tagstr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<opentype_feature_friendlynames>())).friendlyname as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(opentype_feature_friendlynames),
            "::",
            stringify!(friendlyname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<opentype_feature_friendlynames>())).masks as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(opentype_feature_friendlynames),
            "::",
            stringify!(masks)
        )
    );
}
extern "C" {
    pub static mut friendlies: [opentype_feature_friendlynames; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct featurescriptlanglist {
    pub featuretag: uint32,
    pub scripts: *mut scriptlanglist,
    pub next: *mut featurescriptlanglist,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_featurescriptlanglist() {
    assert_eq!(
        ::std::mem::size_of::<featurescriptlanglist>(),
        32usize,
        concat!("Size of: ", stringify!(featurescriptlanglist))
    );
    assert_eq!(
        ::std::mem::align_of::<featurescriptlanglist>(),
        8usize,
        concat!("Alignment of ", stringify!(featurescriptlanglist))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<featurescriptlanglist>())).featuretag as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(featurescriptlanglist),
            "::",
            stringify!(featuretag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<featurescriptlanglist>())).scripts as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(featurescriptlanglist),
            "::",
            stringify!(scripts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<featurescriptlanglist>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(featurescriptlanglist),
            "::",
            stringify!(next)
        )
    );
}
impl featurescriptlanglist {
    #[inline]
    pub fn ismac(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ismac(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ismac: ::std::os::raw::c_uint) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ismac: u32 = unsafe { ::std::mem::transmute(ismac) };
            ismac as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type FeatureScriptLangList = featurescriptlanglist;
pub const pst_flags_pst_r2l: pst_flags = 1;
pub const pst_flags_pst_ignorebaseglyphs: pst_flags = 2;
pub const pst_flags_pst_ignoreligatures: pst_flags = 4;
pub const pst_flags_pst_ignorecombiningmarks: pst_flags = 8;
pub const pst_flags_pst_usemarkfilteringset: pst_flags = 16;
pub const pst_flags_pst_markclass: pst_flags = 65280;
pub const pst_flags_pst_markset: pst_flags = 4294901760;
pub type pst_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lookup_subtable {
    pub subtable_name: *mut ::std::os::raw::c_char,
    pub suffix: *mut ::std::os::raw::c_char,
    pub separation: int16,
    pub minkern: int16,
    pub lookup: *mut otlookup,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub kc: *mut kernclass,
    pub fpst: *mut generic_fpst,
    pub sm: *mut generic_asm,
    pub next: *mut lookup_subtable,
    pub subtable_offset: int32,
    pub extra_subtables: *mut int32,
}
#[test]
fn bindgen_test_layout_lookup_subtable() {
    assert_eq!(
        ::std::mem::size_of::<lookup_subtable>(),
        88usize,
        concat!("Size of: ", stringify!(lookup_subtable))
    );
    assert_eq!(
        ::std::mem::align_of::<lookup_subtable>(),
        8usize,
        concat!("Alignment of ", stringify!(lookup_subtable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).subtable_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(subtable_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).suffix as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(suffix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).separation as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(separation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).minkern as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(minkern)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).lookup as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(lookup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).kc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(kc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).fpst as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(fpst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).sm as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(sm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).next as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).subtable_offset as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(subtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lookup_subtable>())).extra_subtables as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lookup_subtable),
            "::",
            stringify!(extra_subtables)
        )
    );
}
impl lookup_subtable {
    #[inline]
    pub fn unused(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn per_glyph_pst_or_kern(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_per_glyph_pst_or_kern(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn anchor_classes(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_anchor_classes(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn vertical_kerning(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_vertical_kerning(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ticked(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ticked(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn kerning_by_touch(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_kerning_by_touch(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn onlyCloser(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_onlyCloser(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dontautokern(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dontautokern(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        unused: ::std::os::raw::c_uint,
        per_glyph_pst_or_kern: ::std::os::raw::c_uint,
        anchor_classes: ::std::os::raw::c_uint,
        vertical_kerning: ::std::os::raw::c_uint,
        ticked: ::std::os::raw::c_uint,
        kerning_by_touch: ::std::os::raw::c_uint,
        onlyCloser: ::std::os::raw::c_uint,
        dontautokern: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let unused: u32 = unsafe { ::std::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let per_glyph_pst_or_kern: u32 =
                unsafe { ::std::mem::transmute(per_glyph_pst_or_kern) };
            per_glyph_pst_or_kern as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let anchor_classes: u32 = unsafe { ::std::mem::transmute(anchor_classes) };
            anchor_classes as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let vertical_kerning: u32 = unsafe { ::std::mem::transmute(vertical_kerning) };
            vertical_kerning as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let ticked: u32 = unsafe { ::std::mem::transmute(ticked) };
            ticked as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let kerning_by_touch: u32 = unsafe { ::std::mem::transmute(kerning_by_touch) };
            kerning_by_touch as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let onlyCloser: u32 = unsafe { ::std::mem::transmute(onlyCloser) };
            onlyCloser as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let dontautokern: u32 = unsafe { ::std::mem::transmute(dontautokern) };
            dontautokern as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct otlookup {
    pub next: *mut otlookup,
    pub lookup_type: otlookup_type,
    pub lookup_flags: uint32,
    pub lookup_name: *mut ::std::os::raw::c_char,
    pub features: *mut FeatureScriptLangList,
    pub subtables: *mut lookup_subtable,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub subcnt: int16,
    pub lookup_index: ::std::os::raw::c_int,
    pub lookup_offset: uint32,
    pub lookup_length: uint32,
    pub tempname: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_otlookup() {
    assert_eq!(
        ::std::mem::size_of::<otlookup>(),
        64usize,
        concat!("Size of: ", stringify!(otlookup))
    );
    assert_eq!(
        ::std::mem::align_of::<otlookup>(),
        8usize,
        concat!("Alignment of ", stringify!(otlookup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_type as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).features as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(features)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).subtables as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(subtables)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).subcnt as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(subcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_index as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_offset as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).lookup_length as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(lookup_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<otlookup>())).tempname as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(otlookup),
            "::",
            stringify!(tempname)
        )
    );
}
impl otlookup {
    #[inline]
    pub fn unused(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn empty(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_empty(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn store_in_afm(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_store_in_afm(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn needs_extension(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_needs_extension(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn temporary_kern(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporary_kern(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn def_lang_checked(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_def_lang_checked(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn def_lang_found(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_def_lang_found(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ticked(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ticked(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn in_gpos(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_in_gpos(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn in_jstf(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_in_jstf(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn only_jstf(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_only_jstf(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        unused: ::std::os::raw::c_uint,
        empty: ::std::os::raw::c_uint,
        store_in_afm: ::std::os::raw::c_uint,
        needs_extension: ::std::os::raw::c_uint,
        temporary_kern: ::std::os::raw::c_uint,
        def_lang_checked: ::std::os::raw::c_uint,
        def_lang_found: ::std::os::raw::c_uint,
        ticked: ::std::os::raw::c_uint,
        in_gpos: ::std::os::raw::c_uint,
        in_jstf: ::std::os::raw::c_uint,
        only_jstf: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let unused: u32 = unsafe { ::std::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let empty: u32 = unsafe { ::std::mem::transmute(empty) };
            empty as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let store_in_afm: u32 = unsafe { ::std::mem::transmute(store_in_afm) };
            store_in_afm as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let needs_extension: u32 = unsafe { ::std::mem::transmute(needs_extension) };
            needs_extension as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let temporary_kern: u32 = unsafe { ::std::mem::transmute(temporary_kern) };
            temporary_kern as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let def_lang_checked: u32 = unsafe { ::std::mem::transmute(def_lang_checked) };
            def_lang_checked as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let def_lang_found: u32 = unsafe { ::std::mem::transmute(def_lang_found) };
            def_lang_found as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let ticked: u32 = unsafe { ::std::mem::transmute(ticked) };
            ticked as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let in_gpos: u32 = unsafe { ::std::mem::transmute(in_gpos) };
            in_gpos as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let in_jstf: u32 = unsafe { ::std::mem::transmute(in_jstf) };
            in_jstf as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let only_jstf: u32 = unsafe { ::std::mem::transmute(only_jstf) };
            only_jstf as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type OTLookup = otlookup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct devicetab {
    pub first_pixel_size: uint16,
    pub last_pixel_size: uint16,
    pub corrections: *mut int8,
}
#[test]
fn bindgen_test_layout_devicetab() {
    assert_eq!(
        ::std::mem::size_of::<devicetab>(),
        16usize,
        concat!("Size of: ", stringify!(devicetab))
    );
    assert_eq!(
        ::std::mem::align_of::<devicetab>(),
        8usize,
        concat!("Alignment of ", stringify!(devicetab))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<devicetab>())).first_pixel_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(devicetab),
            "::",
            stringify!(first_pixel_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<devicetab>())).last_pixel_size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(devicetab),
            "::",
            stringify!(last_pixel_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<devicetab>())).corrections as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(devicetab),
            "::",
            stringify!(corrections)
        )
    );
}
pub type DeviceTable = devicetab;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct valdev {
    pub xadjust: DeviceTable,
    pub yadjust: DeviceTable,
    pub xadv: DeviceTable,
    pub yadv: DeviceTable,
}
#[test]
fn bindgen_test_layout_valdev() {
    assert_eq!(
        ::std::mem::size_of::<valdev>(),
        64usize,
        concat!("Size of: ", stringify!(valdev))
    );
    assert_eq!(
        ::std::mem::align_of::<valdev>(),
        8usize,
        concat!("Alignment of ", stringify!(valdev))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<valdev>())).xadjust as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(valdev),
            "::",
            stringify!(xadjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<valdev>())).yadjust as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(valdev),
            "::",
            stringify!(yadjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<valdev>())).xadv as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(valdev),
            "::",
            stringify!(xadv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<valdev>())).yadv as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(valdev),
            "::",
            stringify!(yadv)
        )
    );
}
pub type ValDevTab = valdev;
pub const anchorclass_type_act_mark: anchorclass_type = 0;
pub const anchorclass_type_act_mkmk: anchorclass_type = 1;
pub const anchorclass_type_act_curs: anchorclass_type = 2;
pub const anchorclass_type_act_mklg: anchorclass_type = 3;
pub const anchorclass_type_act_unknown: anchorclass_type = 4;
pub type anchorclass_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct anchorclass {
    pub name: *mut ::std::os::raw::c_char,
    pub subtable: *mut lookup_subtable,
    pub type_: uint8,
    pub has_base: uint8,
    pub processed: uint8,
    pub has_mark: uint8,
    pub matches: uint8,
    pub ac_num: uint8,
    pub ticked: uint8,
    pub next: *mut anchorclass,
}
#[test]
fn bindgen_test_layout_anchorclass() {
    assert_eq!(
        ::std::mem::size_of::<anchorclass>(),
        32usize,
        concat!("Size of: ", stringify!(anchorclass))
    );
    assert_eq!(
        ::std::mem::align_of::<anchorclass>(),
        8usize,
        concat!("Alignment of ", stringify!(anchorclass))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).subtable as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(subtable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).has_base as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(has_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).processed as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(processed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).has_mark as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(has_mark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).matches as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(matches)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).ac_num as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(ac_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).ticked as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(ticked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorclass>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorclass),
            "::",
            stringify!(next)
        )
    );
}
pub type AnchorClass = anchorclass;
pub const anchor_type_at_mark: anchor_type = 0;
pub const anchor_type_at_basechar: anchor_type = 1;
pub const anchor_type_at_baselig: anchor_type = 2;
pub const anchor_type_at_basemark: anchor_type = 3;
pub const anchor_type_at_centry: anchor_type = 4;
pub const anchor_type_at_cexit: anchor_type = 5;
pub const anchor_type_at_max: anchor_type = 6;
pub type anchor_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct anchorpoint {
    pub anchor: *mut AnchorClass,
    pub me: BasePoint,
    pub xadjust: DeviceTable,
    pub yadjust: DeviceTable,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub ttf_pt_index: uint16,
    pub lig_index: int16,
    pub next: *mut anchorpoint,
}
#[test]
fn bindgen_test_layout_anchorpoint() {
    assert_eq!(
        ::std::mem::size_of::<anchorpoint>(),
        72usize,
        concat!("Size of: ", stringify!(anchorpoint))
    );
    assert_eq!(
        ::std::mem::align_of::<anchorpoint>(),
        8usize,
        concat!("Alignment of ", stringify!(anchorpoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).anchor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).me as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(me)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).xadjust as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(xadjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).yadjust as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(yadjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).ttf_pt_index as *const _ as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(ttf_pt_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).lig_index as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(lig_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<anchorpoint>())).next as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(anchorpoint),
            "::",
            stringify!(next)
        )
    );
}
impl anchorpoint {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn selected(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_selected(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ticked(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ticked(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn has_ttf_pt(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_has_ttf_pt(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: ::std::os::raw::c_uint,
        selected: ::std::os::raw::c_uint,
        ticked: ::std::os::raw::c_uint,
        has_ttf_pt: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let selected: u32 = unsafe { ::std::mem::transmute(selected) };
            selected as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let ticked: u32 = unsafe { ::std::mem::transmute(ticked) };
            ticked as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let has_ttf_pt: u32 = unsafe { ::std::mem::transmute(has_ttf_pt) };
            has_ttf_pt as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type AnchorPoint = anchorpoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kernpair {
    pub subtable: *mut lookup_subtable,
    pub sc: *mut splinechar,
    pub off: int16,
    pub kcid: uint16,
    pub adjust: *mut DeviceTable,
    pub next: *mut kernpair,
}
#[test]
fn bindgen_test_layout_kernpair() {
    assert_eq!(
        ::std::mem::size_of::<kernpair>(),
        40usize,
        concat!("Size of: ", stringify!(kernpair))
    );
    assert_eq!(
        ::std::mem::align_of::<kernpair>(),
        8usize,
        concat!("Alignment of ", stringify!(kernpair))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).subtable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(subtable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).sc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(sc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).off as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).kcid as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(kcid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).adjust as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(adjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernpair>())).next as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(kernpair),
            "::",
            stringify!(next)
        )
    );
}
pub type KernPair = kernpair;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kernclass {
    pub first_cnt: ::std::os::raw::c_int,
    pub second_cnt: ::std::os::raw::c_int,
    pub firsts: *mut *mut ::std::os::raw::c_char,
    pub seconds: *mut *mut ::std::os::raw::c_char,
    pub firsts_names: *mut *mut ::std::os::raw::c_char,
    pub seconds_names: *mut *mut ::std::os::raw::c_char,
    pub firsts_flags: *mut ::std::os::raw::c_int,
    pub seconds_flags: *mut ::std::os::raw::c_int,
    pub subtable: *mut lookup_subtable,
    pub kcid: uint16,
    pub offsets: *mut int16,
    pub offsets_flags: *mut ::std::os::raw::c_int,
    pub adjusts: *mut DeviceTable,
    pub next: *mut kernclass,
    pub feature: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_kernclass() {
    assert_eq!(
        ::std::mem::size_of::<kernclass>(),
        112usize,
        concat!("Size of: ", stringify!(kernclass))
    );
    assert_eq!(
        ::std::mem::align_of::<kernclass>(),
        8usize,
        concat!("Alignment of ", stringify!(kernclass))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).first_cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(first_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).second_cnt as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(second_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).firsts as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(firsts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).seconds as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(seconds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).firsts_names as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(firsts_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).seconds_names as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(seconds_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).firsts_flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(firsts_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).seconds_flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(seconds_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).subtable as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(subtable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).kcid as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(kcid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).offsets as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(offsets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).offsets_flags as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(offsets_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).adjusts as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(adjusts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).next as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<kernclass>())).feature as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(kernclass),
            "::",
            stringify!(feature)
        )
    );
}
pub type KernClass = kernclass;
pub const possub_type_pst_null: possub_type = 0;
pub const possub_type_pst_position: possub_type = 1;
pub const possub_type_pst_pair: possub_type = 2;
pub const possub_type_pst_substitution: possub_type = 3;
pub const possub_type_pst_alternate: possub_type = 4;
pub const possub_type_pst_multiple: possub_type = 5;
pub const possub_type_pst_ligature: possub_type = 6;
pub const possub_type_pst_lcaret: possub_type = 7;
pub const possub_type_pst_max: possub_type = 8;
pub const possub_type_pst_kerning: possub_type = 8;
pub const possub_type_pst_vkerning: possub_type = 9;
pub const possub_type_pst_anchors: possub_type = 10;
pub const possub_type_pst_contextpos: possub_type = 11;
pub const possub_type_pst_contextsub: possub_type = 12;
pub const possub_type_pst_chainpos: possub_type = 13;
pub const possub_type_pst_chainsub: possub_type = 14;
pub const possub_type_pst_reversesub: possub_type = 15;
pub const possub_type_fpst_max: possub_type = 16;
pub const possub_type_pst_kernback: possub_type = 17;
pub const possub_type_pst_vkernback: possub_type = 18;
pub type possub_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr {
    pub xoff: int16,
    pub yoff: int16,
    pub h_adv_off: int16,
    pub v_adv_off: int16,
    pub adjust: *mut ValDevTab,
}
#[test]
fn bindgen_test_layout_vr() {
    assert_eq!(
        ::std::mem::size_of::<vr>(),
        16usize,
        concat!("Size of: ", stringify!(vr))
    );
    assert_eq!(
        ::std::mem::align_of::<vr>(),
        8usize,
        concat!("Alignment of ", stringify!(vr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vr>())).xoff as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(vr), "::", stringify!(xoff))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vr>())).yoff as *const _ as usize },
        2usize,
        concat!("Offset of field: ", stringify!(vr), "::", stringify!(yoff))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vr>())).h_adv_off as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vr),
            "::",
            stringify!(h_adv_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vr>())).v_adv_off as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(vr),
            "::",
            stringify!(v_adv_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vr>())).adjust as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vr),
            "::",
            stringify!(adjust)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct generic_pst {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub type_: uint8,
    pub subtable: *mut lookup_subtable,
    pub next: *mut generic_pst,
    pub u: generic_pst__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union generic_pst__bindgen_ty_1 {
    pub pos: vr,
    pub pair: generic_pst__bindgen_ty_1__bindgen_ty_1,
    pub subs: generic_pst__bindgen_ty_1__bindgen_ty_2,
    pub mult: generic_pst__bindgen_ty_1__bindgen_ty_3,
    pub alt: generic_pst__bindgen_ty_1__bindgen_ty_3,
    pub lig: generic_pst__bindgen_ty_1__bindgen_ty_4,
    pub lcaret: generic_pst__bindgen_ty_1__bindgen_ty_5,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_pst__bindgen_ty_1__bindgen_ty_1 {
    pub paired: *mut ::std::os::raw::c_char,
    pub vr: *mut vr,
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_1>())).paired as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(paired)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_1>())).vr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(vr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_pst__bindgen_ty_1__bindgen_ty_2 {
    pub variant: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_2>())).variant as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(variant)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_pst__bindgen_ty_1__bindgen_ty_3 {
    pub components: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_3>())).components
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(components)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_pst__bindgen_ty_1__bindgen_ty_4 {
    pub components: *mut ::std::os::raw::c_char,
    pub lig: *mut splinechar,
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1__bindgen_ty_4>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_4>())).components
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(components)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_4>())).lig as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(lig)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_pst__bindgen_ty_1__bindgen_ty_5 {
    pub carets: *mut int16,
    pub cnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1__bindgen_ty_5>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_5>())).carets as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(carets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1__bindgen_ty_5>())).cnt as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(cnt)
        )
    );
}
#[test]
fn bindgen_test_layout_generic_pst__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(generic_pst__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(generic_pst__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).pair as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(pair)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).subs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(subs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).mult as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).alt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).lig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(lig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_pst__bindgen_ty_1>())).lcaret as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst__bindgen_ty_1),
            "::",
            stringify!(lcaret)
        )
    );
}
#[test]
fn bindgen_test_layout_generic_pst() {
    assert_eq!(
        ::std::mem::size_of::<generic_pst>(),
        40usize,
        concat!("Size of: ", stringify!(generic_pst))
    );
    assert_eq!(
        ::std::mem::align_of::<generic_pst>(),
        8usize,
        concat!("Alignment of ", stringify!(generic_pst))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst>())).type_ as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst>())).subtable as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst),
            "::",
            stringify!(subtable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_pst>())).u as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_pst),
            "::",
            stringify!(u)
        )
    );
}
impl generic_pst {
    #[inline]
    pub fn ticked(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ticked(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn temporary(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporary(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ticked: ::std::os::raw::c_uint,
        temporary: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ticked: u32 = unsafe { ::std::mem::transmute(ticked) };
            ticked as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let temporary: u32 = unsafe { ::std::mem::transmute(temporary) };
            temporary as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type PST = generic_pst;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct liglist {
    pub lig: *mut PST,
    pub first: *mut splinechar,
    pub components: *mut splinecharlist,
    pub next: *mut liglist,
    pub ccnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_liglist() {
    assert_eq!(
        ::std::mem::size_of::<liglist>(),
        40usize,
        concat!("Size of: ", stringify!(liglist))
    );
    assert_eq!(
        ::std::mem::align_of::<liglist>(),
        8usize,
        concat!("Alignment of ", stringify!(liglist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<liglist>())).lig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(liglist),
            "::",
            stringify!(lig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<liglist>())).first as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(liglist),
            "::",
            stringify!(first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<liglist>())).components as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(liglist),
            "::",
            stringify!(components)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<liglist>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(liglist),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<liglist>())).ccnt as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(liglist),
            "::",
            stringify!(ccnt)
        )
    );
}
pub type LigList = liglist;
pub const fpossub_format_pst_glyphs: fpossub_format = 0;
pub const fpossub_format_pst_class: fpossub_format = 1;
pub const fpossub_format_pst_coverage: fpossub_format = 2;
pub const fpossub_format_pst_reversecoverage: fpossub_format = 3;
pub const fpossub_format_pst_formatmax: fpossub_format = 4;
pub type fpossub_format = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct seqlookup {
    pub seq: ::std::os::raw::c_int,
    pub lookup: *mut otlookup,
}
#[test]
fn bindgen_test_layout_seqlookup() {
    assert_eq!(
        ::std::mem::size_of::<seqlookup>(),
        16usize,
        concat!("Size of: ", stringify!(seqlookup))
    );
    assert_eq!(
        ::std::mem::align_of::<seqlookup>(),
        8usize,
        concat!("Alignment of ", stringify!(seqlookup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<seqlookup>())).seq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(seqlookup),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<seqlookup>())).lookup as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(seqlookup),
            "::",
            stringify!(lookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpg {
    pub names: *mut ::std::os::raw::c_char,
    pub back: *mut ::std::os::raw::c_char,
    pub fore: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_fpg() {
    assert_eq!(
        ::std::mem::size_of::<fpg>(),
        24usize,
        concat!("Size of: ", stringify!(fpg))
    );
    assert_eq!(
        ::std::mem::align_of::<fpg>(),
        8usize,
        concat!("Alignment of ", stringify!(fpg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpg>())).names as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpg),
            "::",
            stringify!(names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpg>())).back as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(fpg), "::", stringify!(back))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpg>())).fore as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(fpg), "::", stringify!(fore))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpc {
    pub ncnt: ::std::os::raw::c_int,
    pub bcnt: ::std::os::raw::c_int,
    pub fcnt: ::std::os::raw::c_int,
    pub nclasses: *mut uint16,
    pub bclasses: *mut uint16,
    pub fclasses: *mut uint16,
    pub allclasses: *mut uint16,
}
#[test]
fn bindgen_test_layout_fpc() {
    assert_eq!(
        ::std::mem::size_of::<fpc>(),
        48usize,
        concat!("Size of: ", stringify!(fpc))
    );
    assert_eq!(
        ::std::mem::align_of::<fpc>(),
        8usize,
        concat!("Alignment of ", stringify!(fpc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).ncnt as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(fpc), "::", stringify!(ncnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).bcnt as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(fpc), "::", stringify!(bcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).fcnt as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(fpc), "::", stringify!(fcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).nclasses as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fpc),
            "::",
            stringify!(nclasses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).bclasses as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fpc),
            "::",
            stringify!(bclasses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).fclasses as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fpc),
            "::",
            stringify!(fclasses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpc>())).allclasses as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fpc),
            "::",
            stringify!(allclasses)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpv {
    pub ncnt: ::std::os::raw::c_int,
    pub bcnt: ::std::os::raw::c_int,
    pub fcnt: ::std::os::raw::c_int,
    pub ncovers: *mut *mut ::std::os::raw::c_char,
    pub bcovers: *mut *mut ::std::os::raw::c_char,
    pub fcovers: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_fpv() {
    assert_eq!(
        ::std::mem::size_of::<fpv>(),
        40usize,
        concat!("Size of: ", stringify!(fpv))
    );
    assert_eq!(
        ::std::mem::align_of::<fpv>(),
        8usize,
        concat!("Alignment of ", stringify!(fpv))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).ncnt as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(fpv), "::", stringify!(ncnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).bcnt as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(fpv), "::", stringify!(bcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).fcnt as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(fpv), "::", stringify!(fcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).ncovers as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fpv),
            "::",
            stringify!(ncovers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).bcovers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fpv),
            "::",
            stringify!(bcovers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpv>())).fcovers as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fpv),
            "::",
            stringify!(fcovers)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpr {
    pub always1: ::std::os::raw::c_int,
    pub bcnt: ::std::os::raw::c_int,
    pub fcnt: ::std::os::raw::c_int,
    pub ncovers: *mut *mut ::std::os::raw::c_char,
    pub bcovers: *mut *mut ::std::os::raw::c_char,
    pub fcovers: *mut *mut ::std::os::raw::c_char,
    pub replacements: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_fpr() {
    assert_eq!(
        ::std::mem::size_of::<fpr>(),
        48usize,
        concat!("Size of: ", stringify!(fpr))
    );
    assert_eq!(
        ::std::mem::align_of::<fpr>(),
        8usize,
        concat!("Alignment of ", stringify!(fpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).always1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpr),
            "::",
            stringify!(always1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).bcnt as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(fpr), "::", stringify!(bcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).fcnt as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(fpr), "::", stringify!(fcnt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).ncovers as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fpr),
            "::",
            stringify!(ncovers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).bcovers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fpr),
            "::",
            stringify!(bcovers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).fcovers as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fpr),
            "::",
            stringify!(fcovers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpr>())).replacements as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fpr),
            "::",
            stringify!(replacements)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fpst_rule {
    pub u: fpst_rule__bindgen_ty_1,
    pub lookup_cnt: ::std::os::raw::c_int,
    pub lookups: *mut seqlookup,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fpst_rule__bindgen_ty_1 {
    pub glyph: fpg,
    pub class: fpc,
    pub coverage: fpv,
    pub rcoverage: fpr,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_fpst_rule__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<fpst_rule__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(fpst_rule__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fpst_rule__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(fpst_rule__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpst_rule__bindgen_ty_1>())).glyph as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule__bindgen_ty_1),
            "::",
            stringify!(glyph)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpst_rule__bindgen_ty_1>())).class as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule__bindgen_ty_1),
            "::",
            stringify!(class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fpst_rule__bindgen_ty_1>())).coverage as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule__bindgen_ty_1),
            "::",
            stringify!(coverage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<fpst_rule__bindgen_ty_1>())).rcoverage as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule__bindgen_ty_1),
            "::",
            stringify!(rcoverage)
        )
    );
}
#[test]
fn bindgen_test_layout_fpst_rule() {
    assert_eq!(
        ::std::mem::size_of::<fpst_rule>(),
        64usize,
        concat!("Size of: ", stringify!(fpst_rule))
    );
    assert_eq!(
        ::std::mem::align_of::<fpst_rule>(),
        8usize,
        concat!("Alignment of ", stringify!(fpst_rule))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpst_rule>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpst_rule>())).lookup_cnt as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule),
            "::",
            stringify!(lookup_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fpst_rule>())).lookups as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fpst_rule),
            "::",
            stringify!(lookups)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generic_fpst {
    pub type_: uint16,
    pub format: uint16,
    pub subtable: *mut lookup_subtable,
    pub next: *mut generic_fpst,
    pub nccnt: uint16,
    pub bccnt: uint16,
    pub fccnt: uint16,
    pub rule_cnt: uint16,
    pub nclass: *mut *mut ::std::os::raw::c_char,
    pub bclass: *mut *mut ::std::os::raw::c_char,
    pub fclass: *mut *mut ::std::os::raw::c_char,
    pub rules: *mut fpst_rule,
    pub ticked: uint8,
    pub effectively_by_glyphs: uint8,
    pub nclassnames: *mut *mut ::std::os::raw::c_char,
    pub bclassnames: *mut *mut ::std::os::raw::c_char,
    pub fclassnames: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_generic_fpst() {
    assert_eq!(
        ::std::mem::size_of::<generic_fpst>(),
        96usize,
        concat!("Size of: ", stringify!(generic_fpst))
    );
    assert_eq!(
        ::std::mem::align_of::<generic_fpst>(),
        8usize,
        concat!("Alignment of ", stringify!(generic_fpst))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).format as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).subtable as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(subtable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).nccnt as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(nccnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).bccnt as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(bccnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).fccnt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(fccnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).rule_cnt as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(rule_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).nclass as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(nclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).bclass as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(bclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).fclass as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(fclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).rules as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(rules)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).ticked as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(ticked)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<generic_fpst>())).effectively_by_glyphs as *const _ as usize
        },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(effectively_by_glyphs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).nclassnames as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(nclassnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).bclassnames as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(bclassnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<generic_fpst>())).fclassnames as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(generic_fpst),
            "::",
            stringify!(fclassnames)
        )
    );
}
pub type FPST = generic_fpst;
pub const asm_type_asm_indic: asm_type = 0;
pub const asm_type_asm_context: asm_type = 1;
pub const asm_type_asm_lig: asm_type = 2;
pub const asm_type_asm_simple: asm_type = 4;
pub const asm_type_asm_insert: asm_type = 5;
pub const asm_type_asm_kern: asm_type = 17;
pub type asm_type = ::std::os::raw::c_uint;
pub const asm_flags_asm_vert: asm_flags = 32768;
pub const asm_flags_asm_descending: asm_flags = 16384;
pub const asm_flags_asm_always: asm_flags = 8192;
pub type asm_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asm_state {
    pub next_state: uint16,
    pub flags: uint16,
    pub u: asm_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union asm_state__bindgen_ty_1 {
    pub context: asm_state__bindgen_ty_1__bindgen_ty_1,
    pub insert: asm_state__bindgen_ty_1__bindgen_ty_2,
    pub kern: asm_state__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asm_state__bindgen_ty_1__bindgen_ty_1 {
    pub mark_lookup: *mut otlookup,
    pub cur_lookup: *mut otlookup,
}
#[test]
fn bindgen_test_layout_asm_state__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<asm_state__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<asm_state__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<asm_state__bindgen_ty_1__bindgen_ty_1>())).mark_lookup
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mark_lookup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<asm_state__bindgen_ty_1__bindgen_ty_1>())).cur_lookup as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cur_lookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asm_state__bindgen_ty_1__bindgen_ty_2 {
    pub mark_ins: *mut ::std::os::raw::c_char,
    pub cur_ins: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_asm_state__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<asm_state__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<asm_state__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<asm_state__bindgen_ty_1__bindgen_ty_2>())).mark_ins as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(mark_ins)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<asm_state__bindgen_ty_1__bindgen_ty_2>())).cur_ins as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(cur_ins)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asm_state__bindgen_ty_1__bindgen_ty_3 {
    pub kerns: *mut int16,
    pub kcnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_asm_state__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<asm_state__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(asm_state__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<asm_state__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
